## Population in Ireland: Where are we heading to?

- Observe the population growth/decline in Ireland from 1960 to 2022.
- Analyse the correlation between the number of births, deaths and marriages, been determining factors in population growth/decline.
- Find an optimal machine learning model that makes projections into the future regarding Ireland’s population.
- Analyse our results in order to make conclusions concerning Ireland’s population stability.

#### Data source
The dataset for this analysis is going to be gotten from the Central Statistics Office (CSO), Ireland. The CSO is responsible for collection, compilation, extraction and dissemination of high-quality data used for analysis of economic and social important topics.

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np

In [2]:
df = pd.read_csv('Total Births, Deaths and Marriages Registered.csv')
df.head(-5)

                          Statistic Label Quarter  State    UNIT   VALUE
0                    Marriages Registered  1960Q1  State  Number  2987.0
1                    Marriages Registered  1960Q2  State  Number  3501.0
2                    Marriages Registered  1960Q3  State  Number  5900.0
3                    Marriages Registered  1960Q4  State  Number  3106.0
4                    Marriages Registered  1961Q1  State  Number  2179.0
...                                   ...     ...    ...     ...     ...
4544  Average age of mothers giving birth  2020Q4  State  Number     NaN
4545  Average age of mothers giving birth  2021Q1  State  Number     NaN
4546  Average age of mothers giving birth  2021Q2  State  Number     NaN
4547  Average age of mothers giving birth  2021Q3  State  Number     NaN
4548  Average age of mothers giving birth  2021Q4  State  Number     NaN

[4549 rows x 5 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4554 entries, 0 to 4553
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Statistic Label  4554 non-null   object
 1   Quarter          4554 non-null   object
 2   State            4554 non-null   object
 3   UNIT             4554 non-null   object
 4   VALUE            1826 non-null   float64
dtypes: float64(1), object(4)
memory usage: 178.0+ KB

In [4]:
df.describe()

              VALUE
count   1826.000000
mean    3977.795016
std     5587.558500
min        0.000000
25%        7.825000
50%       20.050000
75%     7348.250000
max    19950.000000

In [5]:
df.isnull().mean()*100 # Porcentage of missing data

Statistic Label     0.000000
Quarter             0.000000
State               0.000000
UNIT                0.000000
VALUE              59.903382
dtype: float64

In [6]:
df['Statistic Label'].unique()

array(['Marriages Registered',
       'Marriage Rate Registered per 1000 Estimated Population',
       'Deaths Registered',
       'Death Rate Registered per 1000 Estimated Population',
       'Deaths of Infants under 1 Year Registered per 1000 Births',
       'Births Registered',
       'Birth Rate Registered per 1000 Estimated Population',
       'Opposite sex marriages', 'Same sex marriages',
       'Civil partnerships', 'Births registered that were first births',
       'Births registered outside marriage', 'Opposite sex marriage rate',
       'Same sex marriage rate', 'Civil partnership marriage rate',
       'Percentage of first births registered',
       'Percentage of births registered outside marriage',
       'Average age of mothers giving birth'], dtype=object)

In [7]:
df['Quarter'].unique()

array(['1960Q1', '1960Q2', '1960Q3', '1960Q4', '1961Q1', '1961Q2',
       '1961Q3', '1961Q4', '1962Q1', '1962Q2', '1962Q3', '1962Q4',
       '1963Q1', '1963Q2', '1963Q3', '1963Q4', '1964Q1', '1964Q2',
       '1964Q3', '1964Q4', '1965Q1', '1965Q2', '1965Q3', '1965Q4',
       '1966Q1', '1966Q2', '1966Q3', '1966Q4', '1967Q1', '1967Q2',
       '1967Q3', '1967Q4', '1968Q1', '1968Q2', '1968Q3', '1968Q4',
       '1969Q1', '1969Q2', '1969Q3', '1969Q4', '1970Q1', '1970Q2',
       '1970Q3', '1970Q4', '1971Q1', '1971Q2', '1971Q3', '1971Q4',
       '1972Q1', '1972Q2', '1972Q3', '1972Q4', '1973Q1', '1973Q2',
       '1973Q3', '1973Q4', '1974Q1', '1974Q2', '1974Q3', '1974Q4',
       '1975Q1', '1975Q2', '1975Q3', '1975Q4', '1976Q1', '1976Q2',
       '1976Q3', '1976Q4', '1977Q1', '1977Q2', '1977Q3', '1977Q4',
       '1978Q1', '1978Q2', '1978Q3', '1978Q4', '1979Q1', '1979Q2',
       '1979Q3', '1979Q4', '1980Q1', '1980Q2', '1980Q3', '1980Q4',
       '1981Q1', '1981Q2', '1981Q3', '1981Q4', '1982Q1', '1982Q2',
       '1982Q3', '1982Q4', '1983Q1', '1983Q2', '1983Q3', '1983Q4',
       '1984Q1', '1984Q2', '1984Q3', '1984Q4', '1985Q1', '1985Q2',
       '1985Q3', '1985Q4', '1986Q1', '1986Q2', '1986Q3', '1986Q4',
       '1987Q1', '1987Q2', '1987Q3', '1987Q4', '1988Q1', '1988Q2',
       '1988Q3', '1988Q4', '1989Q1', '1989Q2', '1989Q3', '1989Q4',
       '1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
       '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
       '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
       '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
       '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
       '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
       '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
       '2000Q3', '2000Q4', '2001Q1', '2001Q2', '2001Q3', '2001Q4',
       '2002Q1', '2002Q2', '2002Q3', '2002Q4', '2003Q1', '2003Q2',
       '2003Q3', '2003Q4', '2004Q1', '2004Q2', '2004Q3', '2004Q4',
       '2005Q1', '2005Q2', '2005Q3', '2005Q4', '2006Q1', '2006Q2',
       '2006Q3', '2006Q4', '2007Q1', '2007Q2', '2007Q3', '2007Q4',
       '2008Q1', '2008Q2', '2008Q3', '2008Q4', '2009Q1', '2009Q2',
       '2009Q3', '2009Q4', '2010Q1', '2010Q2', '2010Q3', '2010Q4',
       '2011Q1', '2011Q2', '2011Q3', '2011Q4', '2012Q1', '2012Q2',
       '2012Q3', '2012Q4', '2013Q1', '2013Q2', '2013Q3', '2013Q4',
       '2014Q1', '2014Q2', '2014Q3', '2014Q4', '2015Q1', '2015Q2',
       '2015Q3', '2015Q4', '2016Q1', '2016Q2', '2016Q3', '2016Q4',
       '2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1', '2018Q2',
       '2018Q3', '2018Q4', '2019Q1', '2019Q2', '2019Q3', '2019Q4',
       '2020Q1', '2020Q2', '2020Q3', '2020Q4', '2021Q1', '2021Q2',
       '2021Q3', '2021Q4', '2022Q1', '2022Q2', '2022Q3', '2022Q4',
       '2023Q1'], dtype=object)

In [8]:
df['State'].unique()

array(['State'], dtype=object)

In [9]:
df.drop(columns='State', inplace=True)
df.head()

        Statistic Label Quarter    UNIT   VALUE
0  Marriages Registered  1960Q1  Number  2987.0
1  Marriages Registered  1960Q2  Number  3501.0
2  Marriages Registered  1960Q3  Number  5900.0
3  Marriages Registered  1960Q4  Number  3106.0
4  Marriages Registered  1961Q1  Number  2179.0

In [10]:
df['UNIT'].unique()

array(['Number', '%'], dtype=object)

In [11]:
df = df[df['UNIT'].str.contains('%')==False]
df['UNIT'].unique()

array(['Number'], dtype=object)

In [12]:
df['label_lc'] = df['Statistic Label'].apply(lambda x: ' '.join(x.lower() for x in x.split())) # put everything in lower case
df[['label_lc']].head()

               label_lc
0  marriages registered
1  marriages registered
2  marriages registered
3  marriages registered
4  marriages registered